Config/Catalogs/ПервичныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПервичныеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ПервичныеДокументыБГУПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Описания первичных документов.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//    * Ключ - Строка
//    * Значение - ФиксированнаяСтруктура:
//      ** ВидПервичногоДокумента - Строка
//      ** Наименование - Строка
//
Функция ОписанияПервичныхДокументов() Экспорт
	ПервичныеДокументы = ПервичныеДокументыБГУ.ОписанияПервичныхДокументов();
	Результат = Новый Соответствие;
	Для Каждого ПервичныйДокумент Из ПервичныеДокументы Цикл
		ОписаниеДокумента = Новый Структура;
		ОписаниеДокумента.Вставить("ВидПервичногоДокумента", ПервичныйДокумент.ВидПервичногоДокумента);
		ОписаниеДокумента.Вставить("Наименование", ПервичныйДокумент.Наименование);
		Результат.Вставить(ПервичныйДокумент.Идентификатор, Новый ФиксированнаяСтруктура(ОписаниеДокумента));
	КонецЦикла;
	Возврат Новый ФиксированноеСоответствие(Результат);
КонецФункции

// Все первичные документы.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//    * Ключ - Строка
//    * Значение - СправочникСсылка.ПервичныеДокументы
Функция ВсеПервичныеДокументы() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервичныеДокументы.Ссылка КАК Ссылка,
	|	ПервичныеДокументы.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.ПервичныеДокументы КАК ПервичныеДокументы
	|ГДЕ
	|	НЕ ПервичныеДокументы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПервичныеДокументы.НеАктуальный";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервичныеДокументы = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Если ПервичныеДокументы.Получить(Выборка.Идентификатор) = Неопределено Тогда
			ПервичныеДокументы.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат Новый ФиксированноеСоответствие(ПервичныеДокументы);

КонецФункции

#КонецОбласти
